In [ ]:
# check the link 

https://youtu.be/JrIG6Qtb4eg?si=ZAo638mmsapSnXYr

In [4]:
import pandas as pd

In [5]:
dict1 = {'Name':['Vijay','Kamal','Suresh','Vimal','Mohan','Sam','Meera'],
         'Marks':[83,86,90,94,95,87,98],
         'Gender':['Female','Male','Male','Male','Female','Male','Female']
                }

df1=pd.DataFrame(dict1)

df1

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
5     Sam     87    Male
6   Meera     98  Female

# 1. Display Top 3 rows of the Dataset

In [6]:
df1.head(3)

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male

# 2. Check Last 3 rows of the Dataset

In [7]:
df1.tail(3)

    Name  Marks  Gender
4  Mohan     95  Female
5    Sam     87    Male
6  Meera     98  Female

# 3- Find shape of our Dataset (Number of rows and number of columns)

In [8]:
df1.shape

(7, 3)

In [9]:
print("Number of Rows", df1.shape[0])
print("Number of Column", df1.shape[1])

Number of Rows 7
Number of Column 3

# 4. Get information about our Dataset Like total number rows and columns, Datatype of each column and memory requirments

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# 5. Check null values in the dataset

In [11]:
df1.isnull () # here boolean values displayed

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [12]:
df1.isnull().sum() # here column name zero null values

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
df1.isnull().sum(axis=1) # here row wise shown zero null values we can change axis 1 to 0

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 6. Get Overall Statistics about the Dataframe

In [16]:
df1.describe()

           Marks
count   7.000000
mean   90.428571
std     5.442338
min    83.000000
25%    86.500000
50%    90.000000
75%    94.500000
max    98.000000

In [17]:
df1.describe(include='all')

         Name      Marks Gender
count       7   7.000000      7
unique      7        NaN      2
top     Vijay        NaN   Male
freq        1        NaN      4
mean      NaN  90.428571    NaN
std       NaN   5.442338    NaN
min       NaN  83.000000    NaN
25%       NaN  86.500000    NaN
50%       NaN  90.000000    NaN
75%       NaN  94.500000    NaN
max       NaN  98.000000    NaN

# 7. Find Unique Values From Gender Column

In [18]:
df1

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
5     Sam     87    Male
6   Meera     98  Female

In [19]:
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

# 8. Find The Number of Unique values from the Gender Column

In [20]:
df1['Gender'].nunique()

2

# 9. Display Count of unique values in Gender Column

In [21]:
df1['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

# 10. Find Total number of students Having Marks Between 90 To 100 (Inclusive) using Between Method

In [22]:
df1['Marks']

0    83
1    86
2    90
3    94
4    95
5    87
6    98
Name: Marks, dtype: int64

In [23]:
df1[df1['Marks']>=90]

     Name  Marks  Gender
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
6   Meera     98  Female

In [24]:
df1[(df1['Marks']>=85)  &  (df1['Marks']<=90)]

     Name  Marks Gender
1   Kamal     86   Male
2  Suresh     90   Male
5     Sam     87   Male

In [25]:
# without using Between method:

count=len(df1[(df1['Marks']>=85) & (df1['Marks']>=90)])

print(f"Here we have 85 to 90 : {count} Students")

Here we have 85 to 90 : 4 Students

In [26]:
# Without using Between Method:

sum(df1['Marks'].between(85,90))

3

# 11. Find Average marks

In [27]:
df1

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
5     Sam     87    Male
6   Meera     98  Female

In [28]:
df1['Marks'].mean() # mean is a average marks , max, min

np.float64(90.42857142857143)

# 12. * Apply Method *

In [29]:
def marks(x):
    return x//2

In [30]:
# Here I find the divide marks of the students using the apply method

df1['Marks'].apply(marks)

0    41
1    43
2    45
3    47
4    47
5    43
6    49
Name: Marks, dtype: int64

In [31]:
# Here i add this half marks into the existed table

df1['Half_Marks'] = df1['Marks'].apply(marks)

In [32]:
df1

     Name  Marks  Gender  Half_Marks
0   Vijay     83  Female          41
1   Kamal     86    Male          43
2  Suresh     90    Male          45
3   Vimal     94    Male          47
4   Mohan     95  Female          47
5     Sam     87    Male          43
6   Meera     98  Female          49

In [33]:
df1['Marks'].apply(lambda x:x //2)

0    41
1    43
2    45
3    47
4    47
5    43
6    49
Name: Marks, dtype: int64

In [34]:
df1

     Name  Marks  Gender  Half_Marks
0   Vijay     83  Female          41
1   Kamal     86    Male          43
2  Suresh     90    Male          45
3   Vimal     94    Male          47
4   Mohan     95  Female          47
5     Sam     87    Male          43
6   Meera     98  Female          49

In [35]:
# Here I drop the unwanted columns using drop column functions

df1=df1.drop(columns=['Half_of_marks'])

KeyError: "['Half_of_marks'] not found in axis"

In [96]:
df1

     Name  Marks  Gender  Half_Marks
0   Vijay     83  Female          41
1   Kamal     86    Male          43
2  Suresh     90    Male          45
3   Vimal     94    Male          47
4   Mohan     95  Female          47
5     Sam     87    Male          43
6   Meera     98  Female          49

In [97]:
# Here we use len in specific column

df1['Name'].apply(len)

0    5
1    5
2    6
3    5
4    5
5    3
6    5
Name: Name, dtype: int64

# 13. Map Function

In [102]:
df1

     Name  Marks  Gender  Half_Marks
0   Vijay     83  Female          41
1   Kamal     86    Male          43
2  Suresh     90    Male          45
3   Vimal     94    Male          47
4   Mohan     95  Female          47
5     Sam     87    Male          43
6   Meera     98  Female          49

In [104]:
df1['Gender'].map({'Male':1,'Female':0})

0    0
1    1
2    1
3    1
4    0
5    1
6    0
Name: Gender, dtype: int64

In [38]:
# Add the above column in to exist column

df1['M_F'] = df1['Gender'].map({'Male':1,'Female':0})

In [39]:
df1

     Name  Marks  Gender  Half_Marks  M_F
0   Vijay     83  Female          41    0
1   Kamal     86    Male          43    1
2  Suresh     90    Male          45    1
3   Vimal     94    Male          47    1
4   Mohan     95  Female          47    0
5     Sam     87    Male          43    1
6   Meera     98  Female          49    0

# 14. Drop the column(s)

In [40]:
df1

     Name  Marks  Gender  Half_Marks  M_F
0   Vijay     83  Female          41    0
1   Kamal     86    Male          43    1
2  Suresh     90    Male          45    1
3   Vimal     94    Male          47    1
4   Mohan     95  Female          47    0
5     Sam     87    Male          43    1
6   Meera     98  Female          49    0

In [41]:
# Here I drop the M_F column

df1.drop('M_F',axis=1)

     Name  Marks  Gender  Half_Marks
0   Vijay     83  Female          41
1   Kamal     86    Male          43
2  Suresh     90    Male          45
3   Vimal     94    Male          47
4   Mohan     95  Female          47
5     Sam     87    Male          43
6   Meera     98  Female          49

In [45]:
# To drop multiple column need a list

df1.drop(['M_F','Half_Marks'],axis=1,inplace=True)

In [46]:
df1

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
5     Sam     87    Male
6   Meera     98  Female

# 14. Print name of the columns

In [47]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [48]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# Sort the dataframe as per the mark column

In [49]:
df1

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
5     Sam     87    Male
6   Meera     98  Female

In [50]:
# Here ascending small to big values using sory_values to verify click (shift + tab) 

df1.sort_values(by='Marks')

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
5     Sam     87    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
6   Meera     98  Female

In [51]:
# Here descending the values

df1.sort_values(by='Marks',ascending=False)

     Name  Marks  Gender
6   Meera     98  Female
4   Mohan     95  Female
3   Vimal     94    Male
2  Suresh     90    Male
5     Sam     87    Male
1   Kamal     86    Male
0   Vijay     83  Female

In [52]:
# Need to sort multiple columns simply do this

df1.sort_values(by=['Marks','Gender'])

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
5     Sam     87    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
6   Meera     98  Female

# 17. Display Name & Marks to the Female Students

In [53]:
df1

     Name  Marks  Gender
0   Vijay     83  Female
1   Kamal     86    Male
2  Suresh     90    Male
3   Vimal     94    Male
4   Mohan     95  Female
5     Sam     87    Male
6   Meera     98  Female

In [54]:
df1['Gender']

0    Female
1      Male
2      Male
3      Male
4    Female
5      Male
6    Female
Name: Gender, dtype: object

In [56]:
# Here shown only boolean values

df1['Gender']=='Male'

0    False
1     True
2     True
3     True
4    False
5     True
6    False
Name: Gender, dtype: bool

In [61]:
# Here I used data frame [] that's why its display the rows
# Here i used 2d List

df1[df1['Gender']=='Male'][['Name','Marks']]

     Name  Marks
1   Kamal     86
2  Suresh     90
3   Vimal     94
5     Sam     87

# Another pandas method also we can sort like above questions

In [62]:
df1['Gender'].isin(['Female'])

0     True
1    False
2    False
3    False
4     True
5    False
6     True
Name: Gender, dtype: bool

In [64]:
# Here i used pandas dataframe

df1[df1['Gender'].isin(['Female'])]

    Name  Marks  Gender
0  Vijay     83  Female
4  Mohan     95  Female
6  Meera     98  Female

In [65]:
# Here i used 2D list that's why its sort Name and Marks

df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

    Name  Marks
0  Vijay     83
4  Mohan     95
6  Meera     98